# Building a Machine Learning App

In [3]:
import pandas as pd
df = pd.read_csv('music.csv')
df.describe()

             age     gender
count  18.000000  18.000000
mean   27.944444   0.500000
std     5.127460   0.514496
min    20.000000   0.000000
25%    25.000000   0.000000
50%    28.000000   0.500000
75%    31.000000   1.000000
max    37.000000   1.000000

## Splitting the Data Set

In [7]:
# We need to split the data set into input and output
# First drop the genre (that is our output)
input_set = df.drop(columns=['genre'])
output_set = df['genre']

input_set
output_set

    age  gender
0    20       1
1    23       1
2    25       1
3    26       1
4    29       1
5    30       1
6    31       1
7    33       1
8    37       1
9    20       0
10   21       0
11   25       0
12   26       0
13   27       0
14   30       0
15   31       0
16   34       0
17   35       0